## Introduction to Pandas

In [28]:
import pandas as pd
import numpy as np

In [29]:
dic = {
    "name":['Rick','Arthur'],
    "marks":[45,34],
    "city":['California','Boston']
}

In [30]:
demo  = pd.DataFrame(dic)
demo

     name  marks        city
0    Rick     45  California
1  Arthur     34      Boston

In [31]:
demo.to_csv('data_index_false.csv',index=False)

In [32]:
demo.head(2)

     name  marks        city
0    Rick     45  California
1  Arthur     34      Boston

In [33]:
demo.tail(1)

     name  marks    city
1  Arthur     34  Boston

**Statstical Observation/Analysis of Data**

In [34]:
demo.describe()           #calculate statisticall analsyis

           marks
count   2.000000
mean   39.500000
std     7.778175
min    34.000000
25%    36.750000
50%    39.500000
75%    42.250000
max    45.000000

In [35]:
demo['marks'][0]  = 90

C:\Users\Gagan\AppData\Local\Temp\ipykernel_15576\3678646553.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  demo['marks'][0]  = 90
C:\Users\Gagan\AppData\Local\Temp\ipykernel_15576\3678646553.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  demo['marks'][0]  = 90

In [36]:
demo

     name  marks        city
0    Rick     90  California
1  Arthur     34      Boston

In [37]:
demo.to_csv('new.csv')

In [38]:
demo.index = ['first','second']         #assign indexes
demo

          name  marks        city
first     Rick     90  California
second  Arthur     34      Boston

In [42]:
ser = pd.Series(np.random.rand(10))
ser

0    0.275508
1    0.263802
2    0.895579
3    0.416722
4    0.723222
5    0.245142
6    0.855375
7    0.779394
8    0.363679
9    0.499087
dtype: float64

In [ ]:
newdata = pd.DataFrame(np.random.rand(334,5),index=np.arange(334))
newdata.head()  #return the head value

          0         1         2         3         4
0  0.730846  0.333443  0.127575  0.117781  0.093553
1  0.131064  0.977994  0.171828  0.640873  0.368295
2  0.617539  0.452833  0.452215  0.066068  0.717821
3  0.075198  0.687241  0.052899  0.539788  0.052831
4  0.833330  0.835649  0.675588  0.178069  0.292172

In [46]:
newdata.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.495817    0.545844    0.523241    0.515337    0.506872
std      0.280541    0.283111    0.290261    0.286230    0.281010
min      0.004009    0.002484    0.001173    0.004296    0.002950
25%      0.257176    0.313212    0.268565    0.281652    0.275816
50%      0.502293    0.592868    0.578109    0.521123    0.517158
75%      0.738910    0.790334    0.762155    0.762913    0.760176
max      0.994704    0.994269    0.999025    0.998321    0.999930

In [55]:
newdata[0][0]= 0.34531

In [56]:
newdata.head()

          0         1         2         3         4
0   0.34531  0.333443  0.127575  0.117781  0.093553
1  0.131064  0.977994  0.171828  0.640873  0.368295
2  0.617539  0.452833  0.452215  0.066068  0.717821
3  0.075198  0.687241  0.052899  0.539788  0.052831
4   0.83333  0.835649  0.675588  0.178069  0.292172

In [57]:
newdata.to_numpy()

array([[0.34531, 0.33344308905358466, 0.1275747570306459,
        0.1177806641463579, 0.09355272855102226],
       [0.13106378462519308, 0.977993552215104, 0.17182759595842978,
        0.6408725040448663, 0.36829477587219883],
       [0.6175394888419644, 0.45283289454886566, 0.4522153384646306,
        0.06606804813190159, 0.7178210571195643],
       ...,
       [0.2780174483365879, 0.8820929163988702, 0.32506999937867065,
        0.28507624032205237, 0.08621681343286991],
       [0.8952224826255718, 0.08074930327127072, 0.7238375374555983,
        0.6716571496635064, 0.9248823433772265],
       [0.8301995514850549, 0.684062614115819, 0.0382147200785381,
        0.4859063204942301, 0.6893959270462704]],
      shape=(334, 5), dtype=object)

In [ ]:
newdata.T      #Transpose

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.34531,0.131064,0.617539,0.075198,0.83333,0.129968,0.181856,0.03077,0.019757,0.674752,...,0.393425,0.595964,0.460129,0.135431,0.221431,0.711154,0.773826,0.278017,0.895222,0.8302
1,0.333443,0.977994,0.452833,0.687241,0.835649,0.481663,0.688528,0.842794,0.11177,0.812125,...,0.56099,0.675003,0.456817,0.625821,0.243317,0.395805,0.246538,0.882093,0.080749,0.684063
2,0.127575,0.171828,0.452215,0.052899,0.675588,0.517708,0.012572,0.397369,0.454958,0.258603,...,0.286102,0.952169,0.919217,0.787868,0.262181,0.75328,0.722964,0.32507,0.723838,0.038215
3,0.117781,0.640873,0.066068,0.539788,0.178069,0.9238,0.760332,0.052124,0.916689,0.685195,...,0.990232,0.686165,0.855354,0.71468,0.847543,0.443655,0.439234,0.285076,0.671657,0.485906
4,0.093553,0.368295,0.717821,0.052831,0.292172,0.777696,0.211751,0.050543,0.175953,0.798531,...,0.984724,0.632487,0.101029,0.694446,0.88403,0.736044,0.911079,0.086217,0.924882,0.689396

In [62]:
newdata.sort_index(axis=1,ascending=False)       #reverse sort

            4         3         2         1         0
0    0.093553  0.117781  0.127575  0.333443   0.34531
1    0.368295  0.640873  0.171828  0.977994  0.131064
2    0.717821  0.066068  0.452215  0.452833  0.617539
3    0.052831  0.539788  0.052899  0.687241  0.075198
4    0.292172  0.178069  0.675588  0.835649   0.83333
..        ...       ...       ...       ...       ...
329  0.736044  0.443655  0.753280  0.395805  0.711154
330  0.911079  0.439234  0.722964  0.246538  0.773826
331  0.086217  0.285076  0.325070  0.882093  0.278017
332  0.924882  0.671657  0.723838  0.080749  0.895222
333  0.689396  0.485906  0.038215  0.684063    0.8302

[334 rows x 5 columns]

In [63]:
newdata.sort_index(axis=0,ascending=False)

            0         1         2         3         4
333    0.8302  0.684063  0.038215  0.485906  0.689396
332  0.895222  0.080749  0.723838  0.671657  0.924882
331  0.278017  0.882093  0.325070  0.285076  0.086217
330  0.773826  0.246538  0.722964  0.439234  0.911079
329  0.711154  0.395805  0.753280  0.443655  0.736044
..        ...       ...       ...       ...       ...
4     0.83333  0.835649  0.675588  0.178069  0.292172
3    0.075198  0.687241  0.052899  0.539788  0.052831
2    0.617539  0.452833  0.452215  0.066068  0.717821
1    0.131064  0.977994  0.171828  0.640873  0.368295
0     0.34531  0.333443  0.127575  0.117781  0.093553

[334 rows x 5 columns]

In [64]:
newdata.head()

          0         1         2         3         4
0   0.34531  0.333443  0.127575  0.117781  0.093553
1  0.131064  0.977994  0.171828  0.640873  0.368295
2  0.617539  0.452833  0.452215  0.066068  0.717821
3  0.075198  0.687241  0.052899  0.539788  0.052831
4   0.83333  0.835649  0.675588  0.178069  0.292172

In [66]:
type(newdata[0])

pandas.core.series.Series

In [71]:
new = newdata.copy()
new[0][0]= 98754353
newdata

C:\Users\Gagan\AppData\Local\Temp\ipykernel_15576\224267802.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  new[0][0]= 98754353
C:\Users\Gagan\AppData\Local\Temp\ipykernel_15576\224267802.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new[0][0]= 98754353

            0         1         2         3         4
0    98754353  0.333443  0.127575  0.117781  0.093553
1    0.131064  0.977994  0.171828  0.640873  0.368295
2    0.617539  0.452833  0.452215  0.066068  0.717821
3    0.075198  0.687241  0.052899  0.539788  0.052831
4     0.83333  0.835649  0.675588  0.178069  0.292172
..        ...       ...       ...       ...       ...
329  0.711154  0.395805  0.753280  0.443655  0.736044
330  0.773826  0.246538  0.722964  0.439234  0.911079
331  0.278017  0.882093  0.325070  0.285076  0.086217
332  0.895222  0.080749  0.723838  0.671657  0.924882
333    0.8302  0.684063  0.038215  0.485906  0.689396

[334 rows x 5 columns]

In [72]:
newdata.loc[0,0] = 654
newdata.head(2)

          0         1         2         3         4
0       654  0.333443  0.127575  0.117781  0.093553
1  0.131064  0.977994  0.171828  0.640873  0.368295